[{
    "id": "1",
    "title": "Data quality assessment for improved decision-making: a methodology for small and medium-sized enterprises",
    "content": "Industrial enterprises rely on prediction of market behavior, monitoring of performance measures, evaluation of production processes and other data analyses to support strategic and operational decisions. However, although an adequate data quality (DQ) is essential for any data analysis and several methodologies for DQ assessment exist, not all organizations consider DQ in decision-making processes. E.g., inaccurate and delayed data acquisition leads to imprecise master data and poor knowledge of machine utilization. While these aspects should influence production planning and control, current approaches to data evaluation are too complex to use them on a-day-to-day basis. In this paper, we propose a methodology that simplifies the execution of DQ evaluations and improves the understandability of its results. One of its main concerns is to make DQ assessment usable to small and medium-sized enterprises (SME). The approach takes selected, context related structured or semi-structured data as input and uses a set of generic test criteria applicable to different tasks and domains. It combines data and domain driven aspects and can be partly executed automated and without context specific domain knowledge. The results of the assessment can be summarized into quality dimensions and used for benchmarking. The methodology is validated using data from the enterprise resource planning (ERP) and manufacturing execution system (MES) of a sheet metal manufacturer covering a year of time. The particular application aims at calculating logistic key performance indicators. Based on these conditions, data requirements are defined and the available data is evaluated considering domain specific characteristics.",
    "date": "December 15, 2022"
  },
  {
    "id": "2",
    "title": "Restaurant Information System (RIS) with QR Code to Improve Service Operations of Casual Fine Dining Restaurant",
    "content": "The rapid growth of technology makes people look forward for innovation that makes transactions faster and easier. For the food industry, a search for techniques that would improve their business functions for the customers would mean an increase in revenue and customer satisfaction. The study highlights on the business process improvements of casual dining restaurant in the Philippines thru the application of Restaurant information system (RIS). Analysis of the current business processes was conducted through interviews and observations. The level of customer satisfaction was evaluated through SERVPERF questionnaires using five (5) dimensions: Tangibles, Reliability, Responsiveness, Assurance, and Empathy. The results show that customer satisfaction levels in ordering, billing and payment processes require improvements. To address these issues, the researchers proposed a web-based system with Quick Response (QR) code functionality which is easy to use for mobile users. A prototype was made and comparison of service times between current and proposed processes was considered.",
    "date": "November 08, 2022"
  },
  {
    "id": "3",
    "title": "Understanding AJAX: Using JavaScript to Create Rich Internet Applications",
    "content": "AJAX: fast mastery for experienced Web developers! Already an experienced Web developer. Apply your skills in today's fastest-growing area of Web development: AJAX! Building on what you already know, this fast-paced guide will show you exactly how to create rich, usable Internet applications. Joshua Eichorn teaches through sophisticated code examples, including extensive server-side PHP code.You won't just learn how to code AJAX applications: Eichorn covers the entire development lifecycle, from use cases and design through debugging. He also presents detailed application case studies, including a start-to-finish update of a non-AJAX application that addresses everything from feature improvements to changing usage patterns. Coverage includes: How AJAX changes the conventional Web development cycle Problems created by the AJAX paradigm -- and how to avoid them Adding AJAX to existing Web applications: key considerations Using core AJAX technologies, including the XMLHttpRequest object Consuming data returned to an AJAX application using both XSLT and JSON Building more usable AJAX applications: guidelines and downloadable resources Use cases: solving real-world problems in the AJAX environment Libraries and toolkits for simplifying AJAX development, including Sarissa, scriptaculous, and HTML_AJAX A complete guide to AJAX debugging Supporting browsers without XMLHttpRequest by using IFrames or cookies JSON data encoding debugging guide, which covers tools for Firefox and Internet Explorer A list of libraries, which includes PHP, .NET, Java, and other libraries that can be used with any server language.",
    "date": "October 29, 2022"
  }
]